neon-smart-studio/W-Link_NeonRTOS_Platform/src/NeonRTOS/kernel/portable/GCC/ARM_CM0_MSPM0Cx/port.c
/*
 * See header file for description.
 */
BaseType_t xPortStartScheduler( void )
{
    /* Make PendSV, CallSV and SysTick the same priority as the kernel. */
    portNVIC_SHPR3_REG |= portNVIC_PENDSV_PRI;
    portNVIC_SHPR3_REG |= portNVIC_SYSTICK_PRI;

    /* Start the timer that generates the tick ISR.  Interrupts are disabled
     * here already. */
    vPortSetupTimerInterrupt();

    /* Initialise the critical nesting count ready for the first task. */
    uxCriticalNesting = 0;

    /* Start the first task. */
    vPortStartFirstTask();

    /* Should never get here as the tasks will now be executing!  Call the task
     * exit error function to prevent compiler warnings about a static function
     * not being called in the case that the application writer overrides this
     * functionality by defining configTASK_RETURN_ADDRESS.  Call
     * vTaskSwitchContext() so link time optimisation does not remove the
     * symbol. */
    vTaskSwitchContext();
    prvTaskExitError();

    /* Should not get here! */
    return 0;
}
/*-----------------------------------------------------------*/

void vPortEndScheduler( void )
{
    /* Not implemented in ports where there is nothing to return to.
     * Artificially force an assert. */
    configASSERT( uxCriticalNesting == 1000UL );
}
/*-----------------------------------------------------------*/

void vPortYield( void )
{
    /* Set a PendSV to request a context switch. */
    portNVIC_INT_CTRL_REG = portNVIC_PENDSVSET_BIT;

    /* Barriers are normally not required but do ensure the code is completely
     * within the specified behaviour for the architecture. */
    __asm volatile ( "dsb" ::: "memory" );
    __asm volatile ( "isb" );
}
/*-----------------------------------------------------------*/

void vPortEnterCritical( void )
{
    portDISABLE_INTERRUPTS();
    uxCriticalNesting++;
    __asm volatile ( "dsb" ::: "memory" );
    __asm volatile ( "isb" );
}
/*-----------------------------------------------------------*/

void vPortExitCritical( void )
{
    configASSERT( uxCriticalNesting );
    uxCriticalNesting--;

    if( uxCriticalNesting == 0 )
    {
        portENABLE_INTERRUPTS();
    }
}
/*-----------------------------------------------------------*/
__attribute__((naked))
uint32_t ulSetInterruptMaskFromISR(void)
{
    __asm volatile
    (
        "mrs r0, PRIMASK \n"
        "cpsid i         \n"
        "bx lr           \n"
        ::: "memory"
    );
}

/*-----------------------------------------------------------*/

__attribute__((naked))
void vClearInterruptMaskFromISR(
    __attribute__((unused)) uint32_t ulMask
)
{
    __asm volatile
    (
        "msr PRIMASK, r0 \n"
        "bx lr           \n"
        ::: "memory"
    );
}
/*-----------------------------------------------------------*/

__attribute__((naked))
void xPortPendSVHandler( void )
{
    /* This is a naked function. */

    __asm volatile
    (
        "	.syntax unified						\n"
        "	mrs r0, psp							\n"
        "										\n"
        "	ldr	r3, pxCurrentTCBConst			\n"/* Get the location of the current TCB. */
        "	ldr	r2, [r3]						\n"
        "										\n"
        "	subs r0, r0, #32					\n"/* Make space for the remaining low registers. */
        "	str r0, [r2]						\n"/* Save the new top of stack. */
        "	stmia r0!, {r4-r7}					\n"/* Store the low registers that are not saved automatically. */
        " 	mov r4, r8							\n"/* Store the high registers. */
        " 	mov r5, r9							\n"
        " 	mov r6, r10							\n"
        " 	mov r7, r11							\n"
        " 	stmia r0!, {r4-r7}					\n"
        "										\n"
        "	push {r3, r14}						\n"
        "	cpsid i								\n"
        "	bl vTaskSwitchContext				\n"
        "	pop {r2, r3}						\n"/* lr goes in r3. r2 now holds tcb pointer. */
        "										\n"
        "	ldr r1, [r2]						\n"
        "	ldr r0, [r1]						\n"/* The first item in pxCurrentTCB is the task top of stack. */
        "	adds r0, r0, #16					\n"/* Move to the high registers. */
        "	ldmia r0!, {r4-r7}					\n"/* Pop the high registers. */
        " 	mov r8, r4							\n"
        " 	mov r9, r5							\n"
        " 	mov r10, r6							\n"
        " 	mov r11, r7							\n"
        "										\n"
        "	msr psp, r0							\n"/* Remember the new top of stack for the task. */
        "										\n"
        "	subs r0, r0, #32					\n"/* Go back for the low registers that are not automatically restored. */
        " 	ldmia r0!, {r4-r7}					\n"/* Pop low registers.  */
        "										\n"
        /*
         * Keep PRIMASK set until the new PSP and all software-saved
         * registers are valid.  This prevents TIMA0 from interrupting a
         * half-restored task context.
         */
        "	cpsie i								\n"
        "	dsb									\n"
        "	isb									\n"
        "	bx r3								\n"
        "										\n"
        "	.align 4							\n"
        "pxCurrentTCBConst: .word pxCurrentTCB	  "
    );
}
/*-----------------------------------------------------------*/

void xPortSysTickHandler( void )
{
    uint32_t ulPreviousMask;

    ulPreviousMask = portSET_INTERRUPT_MASK_FROM_ISR();
    {
        /* Increment the RTOS tick. */
        if( xTaskIncrementTick() != pdFALSE )
        {
            /* Pend a context switch. */
            portNVIC_INT_CTRL_REG = portNVIC_PENDSVSET_BIT;
        }
    }
    portCLEAR_INTERRUPT_MASK_FROM_ISR( ulPreviousMask );
}

void TIMG8_IRQHandler(void)
{
    switch (DL_TimerG_getPendingInterrupt(TIMG8_BASE))
    {
        case DL_TIMERG_IIDX_ZERO:
            xPortSysTickHandler();
            break;

        default:
            break;
    }
}

void FreeRTOS_TIMG8_Init(
    GPTIMER_Regs *timer,
    uint32_t period
)
{
    const DL_TimerG_ClockConfig clockConfig =
    {
        .clockSel     = DL_TIMER_CLOCK_BUSCLK,
        .divideRatio  = DL_TIMER_CLOCK_DIVIDE_1,
        .prescale     = 0U
    };

    const DL_TimerG_TimerConfig timerConfig =
    {
        .period       = period - 1U,
        .timerMode    = DL_TIMER_TIMER_MODE_PERIODIC,
        .startTimer   = DL_TIMER_STOP
    };

    DL_TimerG_reset(timer);
    DL_TimerG_enablePower(timer);
    delay_cycles(64U);

    DL_TimerG_setClockConfig(
        timer,
        (DL_TimerG_ClockConfig *)&clockConfig
    );

    DL_TimerG_initTimerMode(
        timer,
        (DL_TimerG_TimerConfig *)&timerConfig
    );

    DL_TimerG_clearInterruptStatus(
        timer,
        DL_TIMERG_INTERRUPT_ZERO_EVENT
    );

    DL_TimerG_enableInterrupt(
        timer,
        DL_TIMERG_INTERRUPT_ZERO_EVENT
    );

    DL_TimerG_enableClock(timer);

    NVIC_DisableIRQ(TIMG8_INT_IRQn);
    NVIC_ClearPendingIRQ(TIMG8_INT_IRQn);

    /* FreeRTOS tick 使用最低 NVIC 優先權。 */
    NVIC_SetPriority(
        TIMG8_INT_IRQn,
        (1UL << __NVIC_PRIO_BITS) - 1UL
    );

    NVIC_EnableIRQ(TIMG8_INT_IRQn);

    DL_TimerG_startCounter(timer);
}
/*-----------------------------------------------------------*/

